{"0":{"points":"<div><h2>What Philosophy Is</h2><ul>    <li>Many answers have been offered in reply to this question</li>    <li>My favorite answer is that philosophy is all of rational inquiry except for science</li>    <li>Questions about the limits of human inquiry and knowledge are philosophical questions</li>  </ul></div>","script":"What is philosophy? Many answers have been offered in reply to this question and most are angling at something similar. My favorite answer is that philosophy is all of rational inquiry except for science. Perhaps you think science exhausts inquiry. About a hundred years ago, many philosophers, especially the Logical Positivists, thought there was nothing we could intelligibly inquire into except for scientific matters. But this view is probably not right. What branch of science addresses the question of whether or not science covers all of rational inquiry? If the question strikes you as puzzling, this might be because you already recognize that whether or not science can answer every question is not itself a scientific issue. Questions about the limits of human inquiry and knowledge are philosophical questions. We can get a better understanding of philosophy by considering what sorts of things humans might inquire into. Philosophical issues are as diverse and far ranging as those we find in the sciences, but a great many of them fall into one of three big topic areas, metaphysics, epistemology, and ethics. "},"1":{"points":"<div><h2>Metaphysics</h2><ul>    <li>Metaphysical issues are concerned with the nature of reality</li>    <li>Many metaphysical questions of interest to contemporary philosophers</li>    <li>Attempts to establish systematic metaphysical world views have been notoriously unsuccessful</li>  </ul></div>","script":" Metaphysical issues are concerned with the nature of reality. Traditional metaphysical issues include the existence of God and the nature of human free will (assuming we have any). Here are a few metaphysical questions of interest to contemporary philosophers: What is a thing? How are space and time related? Does the past exist? How about the future? How many dimensions does the world have? Are there any entities beyond physical objects (like numbers, properties, and relations)? If so, how are they related to physical objects? Historically, many philosophers have proposed and defended specific metaphysical positions, often as part of systematic and comprehensive metaphysical views. But attempts to establish systematic metaphysical world views have been notoriously unsuccessful. Since the 19th century many philosophers and scientists have been understandably suspicious of metaphysics, and it has frequently been dismissed as a waste of time, or worse, as meaningless. But in just the past few decades metaphysics has returned to vitality. As difficult as they are to resolve, metaphysical issues are also difficult to ignore for long. Contemporary analytic metaphysics is typically taken to have more modest aims than definitively settling on the final and complete truth about the underlying nature of reality. A better way to understand metaphysics as it is currently practiced is as aiming at better understanding how various claims about the reality logically hang together or conflict. Metaphysicians analyze metaphysical puzzles and problems with the goal of better understanding how things could or could not be. Metaphysicians are in the business of exploring the realm of possibility and necessity. They are explorers of logical space. "},"2":{"points":"<div><h2>Epistemology</h2><ul>    <li>Epistemology is concerned with the nature of knowledge and justified belief</li>    <li>Questions about what it is for a belief to be rationally justified</li>    <li>Questions about what we ought to believe</li>  </ul></div>","script":" Epistemology is concerned with the nature of knowledge and justified belief. What is knowledge? Can we have any knowledge at all? Can we have knowledge about the laws of nature, the laws or morality, or the existence of other minds? The view that we can’t have knowledge is called skepticism. An extreme form of skepticism denies that we can have any knowledge whatsoever. But we might grant that we can have knowledge about some things and remain skeptics concerning other issues. Many people, for instance, are not skeptics about scientific knowledge, but are skeptics when it comes to knowledge of morality. Even if we lack absolute and certain knowledge of many things, our beliefs about those things might yet be more or less reasonable or more or less likely to be true given the limited evidence we have. Epistemology is also concerned with what it is for a belief to be rationally justified. Even if we can’t have certain knowledge of anything (or much), questions about what we ought to believe remain relevant. "},"3":{"points":"<div><h2>Ethics</h2><ul>    <li>Ethics is concerned with what we ought to do, how we ought to live, and how we ought to organize our communities</li>    <li>Commands are simply to be obeyed, they are not to be inquired into, assessed for reasonableness, or tested against the evidence</li>    <li>Many of the popular reasons for being more skeptical about morality than science turn on philosophical confusions</li>  </ul></div>","script":" Ethics is concerned with what we ought to do, how we ought to live, and how we ought to organize our communities. Sadly, it comes as a surprise to many new philosophy students that you can reason about such things. Religiously inspired views about"}}