{"0":{"points":"<div><h2>What Philosophy Is</h2><ul>    <li>Philosophy defined</li>    <li>The relationship between philosophy and science</li>    <li>Three big topic areas in philosophy: metaphysics, epistemology, and ethics</li>  </ul></div>","script":"What is philosophy? Many answers have been offered in reply to this question and most are angling at something similar. My favorite answer is that philosophy is all of rational inquiry except for science. Perhaps you think science exhausts inquiry. About a hundred years ago, many philosophers, especially the Logical Positivists, thought there was nothing we could intelligibly inquire into except for scientific matters. But this view is probably not right. What branch of science addresses the question of whether or not science covers all of rational inquiry? If the question strikes you as puzzling, this might be because you already recognize that whether or not science can answer every question is not itself a scientific issue. Questions about the limits of human inquiry and knowledge are philosophical questions. We can get a better understanding of philosophy by considering what sorts of things other than scientific issues humans might inquire into. Philosophical issues are as diverse and far ranging as those we find in the sciences, but a great many of them fall into one of three big topic areas, metaphysics, epistemology, and ethics."},"1":{"points":"<div><h2>Metaphysics</h2><ul>    <li>The nature of reality</li>    <li>Traditional metaphysical issues</li>    <li>Contemporary metaphysics</li>  </ul></div>","script":"\n\nMetaphysical issues are concerned with the nature of reality. Traditional metaphysical issues include the existence of God and the nature of human free will (assuming we have any). Here are a few metaphysical questions of interest to contemporary philosophers: What is a thing? How are space and time related? Does the past exist? How about the future? How many dimensions does the world have? Are there any entities beyond physical objects (like numbers, properties, and relations)? If so, how are they related to physical objects? Historically, many philosophers have proposed and defended specific metaphysical positions, often as part of systematic and comprehensive metaphysical views. But attempts to establish systematic metaphysical world views have been notoriously unsuccessful. Since the 19th century many philosophers and scientists have been understandably suspicious of metaphysics, and it has frequently been dismissed as a waste of time, or worse, as meaningless. But in just the past few decades metaphysics has returned to vitality. As difficult as they are to resolve, metaphysical issues are also difficult to ignore for long. Contemporary analytic metaphysics is typically taken to have more modest aims than definitively settling on the final and complete truth about the underlying nature of reality."},"2":{"points":"<div><h2>Epistemology</h2><ul>    <li>The nature of knowledge and justified belief</li>    <li>Skepticism</li>    <li>Rational justification of beliefs</li>  </ul></div>","script":"\n\nEpistemology is concerned with the nature of knowledge and justified belief. What is knowledge? Can we have any knowledge at all? Can we have knowledge about the laws of nature, the laws or morality, or the existence of other minds? The view that we can’t have knowledge is called skepticism. An extreme form of skepticism denies that we can have any knowledge whatsoever. But we might grant that we can have knowledge about some things and remain skeptics concerning other issues. Many people, for instance, are not skeptics about scientific knowledge, but are skeptics when it comes to knowledge of morality. Later in this course we will entertain some skeptical worries about science and we will consider whether ethics is really in a more precarious position. Some critical attention reveals that scientific knowledge and moral knowledge face many of the same skeptical challenges and share some similar resources in addressing those challenges. Many of the popular reasons for being more skeptical about morality than science turn on philosophical confusions we will address and attempt to clear up. Even if we lack absolute and certain knowledge of many things, our beliefs about those things might yet be more or less reasonable or more or less likely to be true given the limited evidence we have. Epistemology is also concerned with what it is for a belief to be rationally justified. Even if we can’t have certain knowledge of anything (or much), questions about what we ought to believe remain relevant."},"3":{"points":"<div><h2>Ethics</h2><ul>    <li>The nature of morality</li>    <li>Rational inquiry into ethical questions</li>    <li>Philosophy vs. religious and relativistic views</li>  </ul></div>","script":"\n\nEthics is concerned with what we ought to do, how we ought to live, and how we ought to organize our communities. Sadly, it comes as a surprise to many new philosophy students that you can reason about such things."},"4":{"points":"<div><h2>The Value of Philosophy</h2><ul>    <li>Knowledge and understanding as the aim of philosophy</li>    <li>The uncertainty and liberation of philosophy</li>    <li>Philosophical questions that may be unanswerable</li>  </ul></div>","script":"\n\nThe nature of morality is a central concern in ethics. What makes an action right or wrong? Are there objective moral truths or is morality simply a matter of personal opinion or cultural relativism? Philosophers have proposed various theories to answer these questions, such as consequentialism, deontology, and virtue ethics. These theories provide frameworks for evaluating moral actions and making ethical judgments. Rational inquiry into ethical questions involves examining the reasons and justifications for different moral beliefs and principles. It requires careful analysis and critical thinking to determine the most reasonable and morally justified course of action. Philosophy also explores the relationship between ethics and religion, as well as the contrast between philosophical and religious or relativistic views on morality. By engaging in ethical inquiry, we can gain a deeper understanding of our values, principles, and responsibilities as moral agents."},"5":{"script":"\n\nThe value of philosophy lies in its pursuit of knowledge and understanding. Philosophy seeks to answer fundamental questions about the nature of reality, knowledge, and morality. It encourages critical thinking, logical reasoning, and intellectual curiosity. Philosophy challenges us to question our assumptions, examine our beliefs, and consider alternative perspectives. It helps us develop the skills to analyze complex issues, evaluate arguments, and make informed decisions. Philosophy also embraces uncertainty and acknowledges that some philosophical questions may be unanswerable. This recognition of the limits of human knowledge and understanding can be both humbling and liberating. It allows us to explore the mysteries of existence and grapple with the profound questions that shape our lives. While philosophy may not provide definitive answers, it offers a framework for exploring and contemplating the deepest mysteries of the universe and our place within it."}}