[
    {
        "name": "part1",
        "title": "What is Philosophy?",
        "bulletPoints": [
            "Philosophy is all of rational inquiry except for science.",
            "Philosophers inquire into areas such as metaphysics, epistemology, and ethics.",
            "Questions about the limits of human inquiry and knowledge are philosophical questions"
        ],
        "script": "Let's start with a simple question: What is philosophy? Philosophy, in essence, is all of rational inquiry except for science. It's a field that delves deep into areas such as metaphysics, epistemology, and ethics. It's about asking questions, particularly those about the limits of human inquiry and knowledge. It's about seeking answers, even when they seem elusive."
    },
    {
        "name": "part2",
        "title": "Metaphysics",
        "bulletPoints": [
            "Metaphysical issues are concerned with the nature of reality.",
            "These issues include the existence of God, the nature of human free will, the structure of space and time, and the existence of entities beyond physical objects."
        ],
        "script": "Moving on to metaphysics, a branch of philosophy that deals with the fundamental nature of reality. It's about asking questions that go beyond the physical. Does God exist? What is the nature of human free will? How is space and time structured? Are there entities beyond physical objects? These are the kind of questions that metaphysics grapples with."
    },
    {
        "name": "part3",
        "title": "Epistemology",
        "bulletPoints": [
            "Epistemology is concerned with the nature of knowledge and justified belief.",
            "It involves evaluating the certainty and rational justification of our beliefs."
        ],
        "script": "Next, we have epistemology. This branch of philosophy is concerned with the nature of knowledge and justified belief. It's about evaluating the certainty and rational justification of our beliefs. It's about asking questions like: What is knowledge? How do we know what we know? How can we justify our beliefs?"
    },
    {
        "name": "part4",
        "title": "Ethics",
        "bulletPoints": [
            "Ethics is concerned with what we ought to do, how we ought to live, and how we ought to organize our communities.",
            "It deals with moral questions and strives for rational inquiry into these matters."
        ],
        "script": "Then, there's ethics. This branch of philosophy is concerned with what we ought to do, how we ought to live, and how we ought to organize our communities. It's about dealing with moral questions and striving for rational inquiry into these matters. It's about asking questions like: What is right and wrong? How should we live our lives? How should we structure our societies?"
    },
    {
        "name": "part5",
        "title": "The Value of Philosophy",
        "bulletPoints": [
            "Philosophy aims at knowledge and understanding.",
            "It can liberate us from narrow-minded conventional thinking and open our minds to new possibilities.",
            "Even if definitive answers can't be found, philosophy still enables us to explore various possibilities and expand our knowledge."
        ],
        "script": "Finally, let's talk about the value of philosophy. Philosophy aims at knowledge and understanding. It can liberate us from narrow-minded conventional thinking and open our minds to new possibilities. Even if definitive answers can't be found, philosophy still enables us to explore various possibilities and expand our knowledge. It's about asking questions, seeking answers, and expanding our understanding of the world around us."
    }
]
