[{"name":"part1","points":"<div><h2>What Philosophy Is</h2><ul>    <li>Definition of philosophy</li>    <li>The misconception that science exhausts inquiry</li>    <li>Branches of philosophy - metaphysics, epistemology, and ethics</li>  </ul></div>","script":"What is philosophy? Many answers have been offered in reply to this question and most are angling at something similar. My favorite answer is that philosophy is all of rational inquiry except for science. Perhaps you think science exhausts inquiry. About a hundred years ago, many philosophers, especially the Logical Positivists, thought there was nothing we could intelligibly inquire into except for scientific matters. But this view is probably not right. What branch of science addresses the question of whether or not science covers all of rational inquiry? If the question strikes you as puzzling, this might be because you already recognize that whether or not science can answer every question is not itself a scientific issue. Questions about the limits of human inquiry and knowledge are philosophical questions. "},{"name":"part2","points":"<div><h2>Metaphysics</h2><ul>    <li>Nature of reality</li>    <li>Traditional metaphysical issues</li>    <li>Contemporary metaphysics</li>  </ul></div>","script":" \n\nMetaphysics is concerned with the nature of reality. Traditional metaphysical issues include the existence of God and the nature of human free will (assuming we have any). Epistemology is concerned with the nature of knowledge and justified belief. What is knowledge? Can we have any knowledge at all? Can we have knowledge about the laws of nature, the laws or morality, or the existence of other minds? The view that we can’t have knowledge is called skepticism. Ethics is concerned with what we ought to do, how we ought to live, and how we ought to organize our communities. "},{"name":"part3","points":"<div><h2>Epistemology</h2><ul>    <li>Nature of knowledge and justified belief</li>    <li>Skepticism</li>    <li>Rational justification of beliefs</li>  </ul></div>","script":" \n\nPhilosophy often provides an antidote to prejudice not by settling big questions, but by revealing just how hard it is to settle those questions. Philosophy liberates us from narrow minded conventional thinking and opens our minds to new possibilities. Philosophy often clearly reveals why some initially attractive answers to big philosophical questions are deeply problematic. The primary value of philosophy is that it loosens the grip of uncritically held opinion and opens the mind to a liberating range of new possibilities to explore. "},{"name":"part4","points":"<div><h2>Ethics</h2><ul>    <li>Concerned with what we ought to do and how we ought to live</li>    <li>Inquiry into moral questions</li>  </ul></div>","script":" \n\nWe should consider rational choice to be liberty of free and open inquiry. We are faced with a stark choice between the feeling of safety we might derive from clinging to opinions we are accustomed to and the liberation that comes with loosening our grip on these in order to explore new ideas. Even where philosophy can’t settle an issue, it’s not quite correct to conclude that there is no right answer. There may still be a specific right answer; we just can’t tell conclusively what it is. "},{"name":"part5","points":"<div><h2>The Value of Philosophy</h2><ul>    <li>Philosophy as a branch of knowledge and understanding</li>    <li>Frustration of easy answers</li>    <li>Liberating doubt and exploration of new possibilities</li>    <li>Uncertainty as a way to expand knowledge</li>  </ul></div>","script":""}]