[{"name":"part1","title":"What Philosophy Is","bulletPoint":["Philosophy is all of rational inquiry except for science.","Philosophical questions address the limits of human inquiry and knowledge.","Philosophy explores metaphysical, epistemological, and ethical issues.","Metaphysical issues concern the nature of reality.","Epistemological issues concern the nature of knowledge and justified belief.","Ethical issues concern what we ought to do, how we ought to live, and how we ought to organize our communities."],"script":"What is philosophy? Many answers have been offered in reply to this question and most are angling at something similar. My favorite answer is that philosophy is all of rational inquiry except for science. Perhaps you think science exhausts inquiry. About a hundred years ago, many philosophers, especially the Logical Positivists, thought there was nothing we could intelligibly inquire into except for scientific matters. But this view is probably not right. What branch of science addresses the question of whether or not science covers all of rational inquiry? If the question strikes you as puzzling, this might be because you already recognize that whether or not science can answer every question is not itself a scientific issue. Questions about the limits of human inquiry and knowledge are philosophical questions. We can get a better understanding of philosophy by considering what sorts of things other than scientific issues humans might inquire into."},{"name":"part2","title":"The Value of Philosophy","bulletPoint":["Philosophy loosens the grip of uncritically held opinions and opens the mind to new possibilities.","Philosophy keeps alive our sense of wonder by showing familiar things in an unfamiliar aspect.","Philosophy can lead us to question our conventional opinions.","Philosophy reveals the difficulty in settling big questions and liberates us from narrow-minded thinking.","Philosophy doesn't necessarily establish definitive knowledge but still offers valuable insights.","Philosophy encourages free and open inquiry by embracing uncertainty and doubt."],"script":"Philosophical issues are as diverse and far ranging as those we find in the sciences, but a great many of them fall into one of three big topic areas, metaphysics, epistemology, and ethics. Metaphysics is concerned with the nature of reality. Traditional metaphysical issues include the existence of God and the nature of human free will. Epistemology is concerned with the nature of knowledge and justified belief. Finally, ethics is concerned with what we ought to do, how we ought to live, and how we ought to organize our communities."}]