[{"name":"part1","title":"What Philosophy Is","bulletPoint":["Philosophy is all of rational inquiry except for science","Philosophical issues fall into the big topic areas of metaphysics, epistemology, and ethics"],"script":"Philosophy is all of rational inquiry except for science. It explores metaphysical, epistemological, and ethical issues such as the nature of reality, the nature of knowledge, and how we ought to live and organize our communities."},{"name":"part2","title":"Metaphysics","bulletPoint":["Metaphysical issues are concerned with the nature of reality","Examples of metaphysical questions include the existence of God and the nature of human free will","Attempts to establish systematic metaphysical world views have been notoriously unsuccessful","Contemporary analytic metaphysics aims at understanding how various claims about reality logically hang together"],"script":"Philosophy aims to better understand and explore various claims about reality and to open our minds to new possibilities. It is a branch of human inquiry that values knowledge and understanding, even though it may not always provide definitive answers."},{"name":"part3","title":"Epistemology","bulletPoint":["Epistemology is concerned with the nature of knowledge and justified belief","Examples of epistemological questions include the extent of human knowledge and the existence of other minds","Questions about what we ought to believe and what rational justification is also fall under epistemology"],"script":"Philosophy helps us question our preconceived notions and encourages us to think critically and philosophically. The value of philosophy lies in its ability to liberate us from limited thinking and to challenge our comfortable beliefs."},{"name":"part4","title":"Ethics","bulletPoint":["Ethics is concerned with what we ought to do, how we ought to live, and how we ought to organize our communities","Philosophy takes seriously the possibility of rational inquiry into morality","Many popular reasons for being more skeptical about morality than science are based on philosophical confusions"],"script":"It keeps alive our sense of wonder and expands our knowledge of what things may be. Philosophy allows us to explore the realm of possibility and necessity, and it is essential for uncovering deeper truths about ourselves and the world around us."}]