[{"name":"part1","title":"What Philosophy Is","bulletPoint":["Philosophy is all of rational inquiry except for science","Philosophical questions include those about the limits of human inquiry and knowledge","Three big topic areas of philosophy are metaphysics, epistemology, and ethics"],"script":"What is philosophy? It is all of rational inquiry except for science. Philosophy addresses questions that science cannot answer. Many philosophical issues fall under metaphysics, epistemology, and ethics. Metaphysics is concerned with the nature of reality. Epistemology is concerned with knowledge and justified belief. Ethics is concerned with what we ought to do and how we ought to live."},{"name":"part2","title":"Metaphysics","bulletPoint":["Metaphysical issues are concerned with the nature of reality","Some metaphysical questions include the existence of God and the nature of human free will","Systematic metaphysical worldviews have been unsuccessful"],"script":"In metaphysics, philosophers ask questions like: What is a thing? How are space and time related? Does the past exist? How many dimensions does the world have? Are there entities beyond physical objects?"},{"name":"part3","title":"Epistemology","bulletPoint":["Epistemology is concerned with the nature of knowledge and justified belief","Questions of skepticism and rational justification fall under epistemology","Epistemology also deals with what beliefs are reasonable given limited evidence"],"script":"Epistemology deals with questions about knowledge. Can we have any knowledge at all? Can we have knowledge about the laws of nature or morality? Skepticism is the view that we can't have knowledge. But even if we lack certain knowledge, our beliefs can be more or less reasonable."},{"name":"part4","title":"Ethics","bulletPoint":["Ethics is concerned with what we ought to do, how we should live, and how we should organize our communities","Religious and moral relativistic views often do not allow for rational inquiry into morality","Philosophy takes seriously the possibility of rational inquiry into ethical matters"],"script":"Ethics considers what we ought to do and how we ought to live. It allows for rational inquiry into morality, rather than blindly following commands. Philosophy challenges conventional thinking and opens our minds to new possibilities."},{"name":"part5","title":"The Value of Philosophy","bulletPoint":["Philosophy frees the mind from narrow-minded conventional thinking","It reveals the difficulty in settling philosophical questions","Philosophy suggests new possibilities and removes dogmatism","Uncertainty in philosophy leads to increased knowledge and wonder"],"script":"The value of philosophy lies in its uncertainty. Philosophy reveals new possibilities and breaks free from the grip of conventional thinking. It liberates us from narrow-mindedness and fosters wonder. Despite the difficulty of finding definitive answers, philosophy leads us to explore new ideas. Philosophical questions may not always have definitive answers, but that doesn't mean there is no right answer. There may still be a truth of the matter, even if we can't conclusively determine it. In summary, philosophy is a diverse field with branches such as metaphysics, epistemology, and ethics. It challenges conventional thinking and opens our minds to new possibilities. While it may not always provide definitive answers, it allows for the exploration of important questions and encourages critical thinking."}]