[{"name":"part1","title":"What is philosophy?","bulletPoint":["Philosophy is all of rational inquiry except for science","Questions about the limits of human inquiry and knowledge are philosophical questions","Philosophical issues fall into three big topic areas: metaphysics, epistemology, and ethics"],"script":"What is philosophy? Many answers have been offered, but my favorite answer is that philosophy is all of rational inquiry except for science. Questions about the limits of human inquiry and knowledge are philosophical questions."},{"name":"part2","title":"Metaphysics","bulletPoint":["Concerned with the nature of reality","Addresses questions about the existence of God, human free will, the nature of a thing, space and time, dimensions of the world, etc.","Attempts to establish systematic metaphysical world views have been unsuccessful"],"script":"Metaphysics is concerned with the nature of reality. Epistemology is concerned with the nature of knowledge and justified belief. Ethics is concerned with what we ought to do, how we ought to live, and how we ought to organize our communities."},{"name":"part3","title":"Epistemology","bulletPoint":["Concerned with the nature of knowledge and justified belief","Questions whether we can have knowledge and to what extent","Includes skepticism and the rational justification of beliefs"],"script":"Philosophy aims at knowledge and understanding. It opens our minds to new possibilities and reveals why some initial answers to philosophical questions may be problematic. Philosophy frees us from narrow-minded thinking and helps us question conventional opinions. It keeps alive our sense of wonder."},{"name":"part4","title":"Ethics","bulletPoint":["Concerned with what we ought to do, how we ought to live, and how we ought to organize our communities","Contrasts with religious and moral relativist views that ignore rational inquiry into morality","Philosophy aims to discover answers to moral questions"],"script":"The value of philosophy lies in its uncertainty. Philosophy suggests many possibilities and removes dogmatism. It liberates us from common sense and expands our knowledge."},{"name":"part5","title":"The Value of Philosophy","bulletPoint":["Philosophy loosens the grip of uncritically held opinions and opens the mind to new possibilities","Philosophy increases knowledge as to what things may be and removes dogmatism","Philosophy frustrates the desire for quick easy answers and fosters inquiry and wonder","Even if philosophy can't settle an issue, there may still be a right answer"],"script":"Some philosophical questions are unanswerable, but that doesn't mean there is no right answer. It just means we may not be able to figure it out. Understanding can still be advanced even when definitive knowledge cannot be obtained."}]